Public Member Functions | Friends | List of all members
ACAPI::ModelViews::View Class Reference
View Handling
A class that represents an Archicad navigator view. More...
#include <View.hpp>
 Inheritance diagram for ACAPI::ModelViews::View:
 Public Member Functions
const API_Guid &  | GetGuid () const
Retrieves the guid of the view.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< View >  | FindViewByGuid (const API_Guid &guid)
Constuct a view object referring to an existing Archicad view by guid.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents an Archicad navigator view.
Member Function Documentation
◆ GetGuid()
 const API_Guid & ACAPI::ModelViews::View::GetGuid  |  ( |   | ) |   const
Retrieves the guid of the view.
Returns
The guid of the view.
Friends And Related Symbol Documentation
◆ FindViewByGuid
 Result< View > FindViewByGuid  |  ( |  const API_Guid & |  guid | )
friend
Constuct a view object referring to an existing Archicad view by guid.
Parameters
guid | The guid of the view.
Returns
Returns the view wrapped in a Result.
It is compatible with the guid member of the API_NavigatorItem struct.